<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","backend":"0a5a7dc0f2db7ba12d61e4b8286f55f99fb1c3d0dedc232d0b4b60c3f612e56c","plan_job_ref":"Job .github/workflows/_test-tf.yaml #113 at https://github.com/DND-IT/github-workflows/actions/runs/16764873486","plan_out_hash":"00f85cd1c9e85d67ba9d0250fca8700db7bba9880fd354a2a15d8923c46bb702","plan_hash":"2dbcb89d9f2550fea2de5f379812081be6785b106b36e07131eda1ebf4399c5e","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __tests/terraform/s3__
With backend config: `bucket=tf-state-911453050078
key=sandbox1.tfstate
workspace_key_prefix=github-workflows
`
With var files: `tests/terraform/s3/environment/sandbox.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #113](https://github.com/DND-IT/github-workflows/actions/runs/16764873486)